
MESSAGES = {
    'welcome':
        'Приветствую! Помогу подать заявку на участие.\n'
        'в слревнованиях. Подробности по команде /help',
}

BUTTONS = {
    'btn_make_registr': 'Подать заявку',
}

REG_MESSAGE = {
    'race_not_found': 'Мероприятие с указанным идентификатором не найдено',
    'category_not_found': 'Выбрана категория, не относящаяся'
                          ' к этому мероприятию',
    'conection_error': 'Сервер регистрации не доступен. Попробуйте'
                       ' повторить отправку позднее',
    'mess_ask_name': 'Введите имя участника',
    'mess_ask_surname': 'Введите фамилию участника',
    'mess_ask_patronymic': 'Введите отчество участника',
    'mess_ask_year': 'Введите год рождения участника',
    'mess_ask_town': 'Введите название города участника',
    'mess_ask_club': 'Введите название клуба, за который'
                      'выступает участник',
    'mess_ask_category': 'Выберите категорию участника',

}

REG_BUTTONS = {
    'race_detail': 'Подробно о событии',
    'pass': 'Пропустить',

}
